controllers/UserPController.php

    public function actionCreate()
    {
        $model = new UserP();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `UserP` (`authKey`, `username`, `password`, `mail`, `alias`) VALUES ('91232', 'duglas', 'duglas', 'duglas@gmail.com', 'dug')