models/UserP.php

                           public static function findByUserName($name)
                           {
                               return new static(self::findOne(['username' => $name]));
---
SELECT * FROM `UserP` WHERE `username`='duglas'